Repository: DanilKorotaev/knowledge-base-app-ios
Catalog: SharedLocalization/Localizable.xcstrings
Source language: en
Languages: ru

# debug.send_logs_message
source: Attach the current session log file to the open chat composer.
ru: Прикрепить текущий лог-файл сессии к открытому чату.

# debug.send
source: Send
ru: Отправить

# debug.no_log_file
source: No log file yet. Enable file logging in Debug → Logs → Settings.
ru: Лог-файла ещё нет. Включите запись в файл: Отладка → Логи → Настройки.

# debug.copy_log_failed
source: Could not copy log file.
ru: Не удалось скопировать лог-файл.

# debug.open_chat_to_attach
source: Open a chat to attach the log file.
ru: Откройте чат, чтобы прикрепить лог-файл.

# debug.log_attached_format
source: Log attached: %@
ru: Лог прикреплён: %@

# debug.menu.logs
source: Logs
ru: Логи

# logs.title
source: Logs
ru: Логи

# logs.files
source: Files
ru: Файлы

# logs.settings
source: Settings
ru: Настройки

# logs.tags
source: Tags
ru: Теги

# logs.log
source: Log
ru: Лог

# logs.logging_into_file
source: Logging into file
ru: Запись в файл

# logs.logging_into_console
source: Logging into console
ru: Запись в консоль

# logs.verbose_network
source: Verbose logs (network cURL + body)
ru: Подробные логи (cURL и тело сети)

# logs.shake_to_send
source: Shake to send logs
ru: Встряхнуть, чтобы отправить логи

# logs.shake_hint
source: When enabled, shake the device to attach the current log file to the open chat.
ru: Если включено, встряхивание устройства прикрепляет текущий лог к открытому чату.

# logs.file_storage_capability
source: File storage capability
ru: Лимит файлов на диске

# logs.copy_all
source: Copy all
ru: Копировать всё

# logs.copy_curl
source: Copy cURL
ru: Копировать cURL

# logs.copy_body
source: Copy body
ru: Копировать тело

# logs.filter_all
source: All
ru: Все

# logs.filter_tags_format
source: Tags: %lld
ru: Теги: %lld

# logs.reset
source: Reset
ru: Сбросить

# ud.settings_title
source: UserDefaults Settings
ru: Настройки UserDefaults

# ud.logging
source: Logging
ru: Логирование

# ud.verbose_restart_footer
source: Changes in verbose logging mode apply after app restart.
ru: Изменения режима подробных логов применяются после перезапуска приложения.

# ud.enabled
source: Enabled
ru: Включено

# ud.verbose_logs
source: Verbose logs
ru: Подробные логи

# ud.ignore_keys
source: Ignore add/update keys
ru: Игнорировать ключи при добавлении/обновлении

# ud.enter_full_key
source: Enter full key
ru: Введите полный ключ

# ud.add
source: Add
ru: Добавить

# ud.filter.all
source: All
ru: Все

# ud.filter.known
source: Known
ru: Известные

# ud.filter.unknown
source: Unknown
ru: Неизвестные

# ud.sort.by_key
source: By Key
ru: По ключу

# ud.sort.by_category
source: By Category
ru: По категории

# ud.category.other
source: Other
ru: Другое

# ud.category.config
source: Config
ru: Конфиг

# ud.category.voice
source: Voice
ru: Голос

# ud.category.sessions
source: Sessions
ru: Сессии

# ud.category.logs
source: Logs
ru: Логи

# ud.category.logger_tags
source: Logger Tags
ru: Теги логгера

# ud.category.inspector
source: Inspector
ru: Инспектор

# ud.add_key_title
source: Add Key
ru: Добавить ключ

# ud.value_saved
source: Value saved
ru: Значение сохранено

# ud.key_section
source: Key
ru: Ключ

# ud.input_mode
source: Input Mode
ru: Режим ввода

# ud.key_mode.registry
source: From Registry
ru: Из реестра

# ud.key_mode.manual
source: Manual
ru: Вручную

# ud.select_a_key
source: Select a key...
ru: Выберите ключ…

# ud.enter_key
source: Enter key
ru: Введите ключ

# ud.type_section
source: Type
ru: Тип

# ud.value_type
source: Value Type
ru: Тип значения

# ud.value_section
source: Value
ru: Значение

# ud.enter_value
source: Enter value
ru: Введите значение

# ud.enter_number
source: Enter number
ru: Введите число

# ud.type_not_creatable
source: This type cannot be created manually
ru: Этот тип нельзя создать вручную

# ud.detail_title
source: Detail
ru: Детали

# ud.value_updated
source: Value updated
ru: Значение обновлено

# ud.info
source: Info
ru: Инфо

# ud.field.key
source: Key
ru: Ключ

# ud.field.type
source: Type
ru: Тип

# ud.field.category
source: Category
ru: Категория

# ud.field.expected_type
source: Expected Type
ru: Ожидаемый тип

# ud.field.description
source: Description
ru: Описание

# ud.archived_fields
source: Archived fields
ru: Архивные поля

# ud.edit_value
source: Edit value
ru: Изменить значение

# ud.data_readonly
source: Data values are read-only
ru: Значения Data только для чтения

# ud.copy_key
source: Copy Key
ru: Копировать ключ

# ud.delete_key
source: Delete Key
ru: Удалить ключ

# ud.copy
source: Copy
ru: Копировать

# ud.select_key_title
source: Select key
ru: Выбор ключа

# ud.update
source: Update
ru: Обновить

# structured_ui.toolbar
source: Interactive UI
ru: Интерактивный экран

# structured_ui.toolbar_on
source: Interactive UI on
ru: Интерактивный UI включён

# structured_ui.toolbar_off
source: Interactive UI off
ru: Интерактивный UI выключен

# structured_ui.toolbar_start
source: Start Interactive UI
ru: Запустить Interactive UI

# structured_ui.dismiss
source: Turn off Interactive UI
ru: Выключить интерактивный экран

# structured_ui.unsupported_schema
source: Update the app to use this interactive screen.
ru: Обновите приложение, чтобы использовать этот интерактивный экран.

# structured_ui.panel_a11y
source: Interactive screen
ru: Интерактивный экран

# structured_ui.updating
source: Updating interactive UI…
ru: Обновляю интерактивный экран…

# structured_ui.updating_a11y
source: Updating interactive screen
ru: Обновление интерактивного экрана

# structured_ui.image_unavailable
source: Image unavailable
ru: Изображение недоступно

# structured_ui.link_fallback
source: Open link
ru: Открыть ссылку

# structured_ui.image_retry
source: Tap to retry
ru: Нажмите, чтобы повторить

# structured_ui.confirm_action
source: Confirm
ru: Подтвердить

# structured_ui.confirm_title
source: Are you sure?
ru: Вы уверены?

# structured_ui.media_load_failed
source: Could not load file
ru: Не удалось загрузить файл

# structured_ui.media_empty_path
source: Media URL is missing
ru: URL медиа не указан

# structured_ui.media_invalid_url
source: Media URL is not allowed
ru: URL медиа не разрешён

# structured_ui.media_http_status_format
source: Media unavailable (HTTP %d)
ru: Медиа недоступно (HTTP %d)

# structured_ui.share_image
source: Share image
ru: Поделиться изображением

# structured_ui.progress_readonly
source: Step status (not interactive)
ru: Статус шага (не интерактивный)

# structured_ui.stepper_value_a11y
source: Current value
ru: Текущее значение

# structured_ui.stepper_adjust_a11y
source: Adjust value
ru: Изменить значение
